Revit 2024 API
BuiltInFailures.SystemsFailures.CreatePartsWithInvalidService Property
 Parts were not created because a system's service is undefined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CreatePartsWithInvalidService { get; }
Visual Basic
Public Shared ReadOnly Property CreatePartsWithInvalidService As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CreatePartsWithInvalidService {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace